In [2]:
import pandas as pd

In [5]:
url = "https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv"

df = pd.read_csv(url)


df.head()

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  C치tia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True

In [6]:
df.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [7]:
df = df.fillna(0)

In [8]:
indices_a_remover = df[(df['Nome'] == 'Alice') | (df['Nome'] == 'Carlos')].index
df = df.drop(indices_a_remover)

df.head()

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    0.0     False
2  C치tia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True

In [9]:
filtro = df['Aprovado'] == True

df = df[filtro]

df.head()

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True

In [10]:
df.to_csv('alunos_aprovados.csv', index=False)

In [11]:
df['Notas'] = df['Notas'].replace(7, 8)
df.head()

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True